[
    {
      "id": "001",
      "company_logo": "https://cdn-icons-png.flaticon.com/512/1384/1384053.png",
      "job_title": "Software Engineer",
      "company_name": "Facebook Inc.",
      "remote_or_onsite": "Remote",
      "location": "San Francisco, CA",
      "fulltime_or_parttime": "Full-time",
      "salary": "Competitive",
      "job_description": "Facebook Inc. is looking for a talented software engineer to join our team. In this role, you will work on building scalable and reliable software products that meet the needs of our customers.",
      "job_responsibility": "Develop and maintain high-quality software products, work collaboratively with cross-functional teams, write clean and maintainable code, participate in code reviews and technical discussions.",
      "educational_requirements": "Bachelor's degree in Computer Science or related field.",
      "experiences": "3+ years of experience in software engineering.",
      "contact_information": {
        "phone": "+1 (555) 555-5555",
        "email": "jobs@facebook.com"
      }
    },
    {
      "id": "002",
      "company_logo": "https://cdn-icons-png.flaticon.com/512/174/174855.png",
      "job_title": "Marketing Manager",
      "company_name": "Instagram Inc.",
      "remote_or_onsite": "Onsite",
      "location": "New York, NY",
      "fulltime_or_parttime": "Full-time",
      "salary": "Competitive",
      "job_description": "Instagram Inc. is seeking a Marketing Manager to join our growing team. In this role, you will develop and execute marketing strategies that drive growth and engagement across our products.",
      "job_responsibility": "Develop and implement marketing strategies, conduct market research and analysis, create and manage marketing campaigns, collaborate with cross-functional teams.",
      "educational_requirements": "Bachelor's degree in Marketing or related field.",
      "experiences": "5+ years of experience in marketing or related field.",
      "contact_information": {
        "phone": "+1 (555) 555-5555",
        "email": "jobs@Instagram.com"
      }
    },
    {
      "id": "003",
      "company_logo": "https://cdn-icons-png.flaticon.com/512/400/400425.png",
      "job_title": "Data Scientist",
      "company_name": "Youtube Inc.",
      "remote_or_onsite": "Onsite",
      "location": "Seattle, WA",
      "fulltime_or_parttime": "Full-time",
      "salary": "Competitive",
      "job_description": "Youtube Inc. is seeking a Data Scientist to help us analyze and derive insights from large datasets. In this role, you will be responsible for building and maintaining models that help us make data-driven decisions.",
      "job_responsibility": "Analyze and interpret complex data, develop and maintain statistical models, create data visualizations and reports, collaborate with cross-functional teams.",
      "educational_requirements": "Master's or PhD degree in Data Science, Statistics, or related field.",
      "experiences": "2+ years of experience in data science or related field.",
      "contact_information": {
        "phone": "+1 (555) 555-5555",
        "email": "jobs@youtube.com"
      }
    },

    {
        "id": "004",
        "company_logo": "https://cdn-icons-png.flaticon.com/512/5968/5968863.png",
        "job_title": "Software Engineer",
        "company_name": "Google Inc.",
        "remote_or_onsite": "Remote",
        "location": "N/A",
        "fulltime_or_parttime": "Full-time",
        "salary": "Competitive",
        "job_description": "Google Inc. is seeking a Software Engineer to join our team. In this role, you will be responsible for designing and developing software solutions that meet the needs of our customers.",
        "job_responsibility": "Design and develop software solutions, participate in code reviews and testing, troubleshoot and debug issues, collaborate with cross-functional teams.",
        "educational_requirements": "Bachelor's or Master's degree in Computer Science or related field.",
        "experiences": "5+ years of experience in software engineering or related field.",
        "contact_information": {
          "phone": "+1 (555) 555-5555",
          "email": "jobs@gmail.com"
        }
    },    
   

      {
         "id": "005",
        "company_logo": "https://as1.ftcdn.net/v2/jpg/03/04/55/12/1000_F_304551232_OwTLSaAoFYDZqahtE9WRkKIoc28nXscm.jpg",
        "job_title": "Product Designer",
        "company_name": "Tweeter Inc.",
        "remote_or_onsite": "Onsite",
        "location": "Los Angeles, CA",
        "fulltime_or_parttime": "Full-time",
        "salary": "Competitive",
        "job_description": "Tweeter Inc. is seeking a Product Designer to join our team. In this role, you will work closely with our product and engineering teams to design intuitive and elegant user interfaces that meet the needs of our customers.",
        "job_responsibility": "Design user interfaces and user experiences, conduct user research and testing, create wireframes and prototypes, collaborate with cross-functional teams.",
        "educational_requirements": "Bachelor's or Master's degree in Design or related field.",
        "experiences": "3+ years of experience in product design or related field.",
        "contact_information": {
          "phone": "+1 (555) 555-5555",
          "email": "jobs@tweet.com"
        }
      },
      {
        "id": "006",
        "company_logo": "https://cdn-icons-png.flaticon.com/512/1384/1384058.png",
        "job_title": "Human Resources Manager",
        "company_name": "Skype Inc.",
        "remote_or_onsite": "Onsite",
        "location": "Chicago, IL",
        "fulltime_or_parttime": "Full-time",
        "salary": "Competitive",
        "job_description": "Skype Inc. is seeking an experienced Human Resources Manager to join our team. In this role, you will be responsible for overseeing all aspects of HR, including talent acquisition, employee relations, compensation and benefits, and compliance.",
        "job_responsibility": "Develop and implement HR policies and procedures, manage talent acquisition and employee onboarding, oversee employee relations and performance management, administer compensation and benefits programs, ensure compliance with HR regulations.",
        "educational_requirements": "Bachelor's or Master's degree in Human Resources or related field.",
        "experiences": "7+ years of experience in human resources management or related field.",
        "contact_information": {
          "phone": "+1 (555) 555-5555",
          "email": "jobs@Skype.com"
        }
      }
    ]
    
  